web2/1

<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope">  <soap12:Body>    <AddModelUUID xmlns="http://tempuri.org/">       <strname></strname>       <strsize></strsize>       <strfile>e082de32-fb77-46cf-9da2-d72d8909d73a</strfile>       <strclass1>工装</strclass1>       <strclass2>室外设计</strclass2>       <strclass3>其他</strclass3>       <itype></itype>       <imode></imode>       <fPrice></fPrice>       <strUUID>792d8d45803641279cf6f047c812db3d</strUUID>       <strAccountType>0</strAccountType>       <strCompanyID>168</strCompanyID>       <strUserID></strUserID>       <strReplaceMaterial></strReplaceMaterial>       </AddModelUUID>  </soap12:Body></soap12:Envelope>